In [ ]:
import pandas as pd

# create a DataFrame
data = {'Name': ['Google', 'Runoob', 'Taobao'], 'Age': [25, 30, 35]}
df = pd.DataFrame(data)

# view the DataFrame
display(df)

     Name  Age
0  Google   25
1  Runoob   30
2  Taobao   35

In [ ]:
import pandas as pd

series_apples = pd.Series([1, 3, 7, 4])
series_bananas = pd.Series([2, 6, 3, 5])

df = pd.DataFrame({ 'Apples': series_apples, 'Bananas': series_bananas })

print(df)

   Apples  Bananas
0       1        2
1       3        6
2       7        3
3       4        5

In [6]:
a = ["Google", "Runoob", "Taobao"]
myVar = pd.Series(a, index=["x", "y", "z"])
display(myVar)

x    Google
y    Runoob
z    Taobao
dtype: str

In [9]:
data = [1, 2, 3, 4, 5]
index = ['a', 'b', 'c', 'd', 'e']
myVar = pd.Series(data, index=index)

display(myVar.index)
display(myVar.values)
display(myVar.dtype)
print(myVar.head(2))

cumsum = myVar.cumsum()
display(cumsum)

Index(['a', 'b', 'c', 'd', 'e'], dtype='str')

array([1, 2, 3, 4, 5])

dtype('int64')

a    1
b    2
dtype: int64

a     1
b     3
c     6
d    10
e    15
dtype: int64

In [11]:

data = [['Google', 10], ['Runoob', 12], ['Wiki', 13]]
df = pd.DataFrame(data, columns=['Site', 'Age'])
display(df)

data2 = {'Site': ['Google', 'Runoob', 'Wiki'], 'Age': [10, 12, 13]}
df2 = pd.DataFrame(data2)
display(df2)

     Site  Age
0  Google   10
1  Runoob   12
2    Wiki   13

     Site  Age
0  Google   10
1  Runoob   12
2    Wiki   13

In [31]:
df = pd.read_csv('nba.csv', sep=',', header=0)
display(df.head())
display(df.head(2))

display(df.tail())
display(df.tail(2))

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [29]:
name = ["Google", "Runoob", "Taobao "]
website = ["www.google.com", "www.runoob.com", "www.taobao.com"]

dict = {'Name': name, 'Website': website}
df = pd.DataFrame(dict)
display(df)

df.to_csv('site.csv', index=False)

      Name         Website
0   Google  www.google.com
1   Runoob  www.runoob.com
2  Taobao   www.taobao.com

In [37]:
df = pd.read_csv('site.csv')
print(df.info())

print("=============================================")

df2 = pd.read_csv('nba.csv')
print(df2.info())

<class 'pandas.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     3 non-null      str
 1   Website  3 non-null      str
dtypes: str(2)
memory usage: 180.0 bytes
None
=============================================
<class 'pandas.DataFrame'>
RangeIndex: 458 entries, 0 to 457
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    str
 1   Team      457 non-null    str
 2   Number    457 non-null    float64
 3   Position  457 non-null    str
 4   Age       457 non-null    float64
 5   Height    457 non-null    str
 6   Weight    457 non-null    float64
 7   College   373 non-null    str
 8   Salary    446 non-null    float64
dtypes: float64(4), str(5)
memory usage: 32.3 KB
None

In [43]:
df = pd.read_excel('runoob_pandas_data.xlsx', sheet_name='sheet 1')

display(df)

  I am the title! Unnamed: 1   Unnamed: 2
0            Name        Age         City
1           Alice         25     New York
2             Bob         30  Los Angeles
3         Charlie         35      Chicago

In [48]:

df = pd.read_json('site.json')
   
display(df)

data =[
    {
      "id": "A001",
      "name": "runoob",
      "url": "www.runoob.com",
      "likes": 61
    },
    {
      "id": "A002",
      "name": "Google",
      "url": "www.google.com",
      "likes": 124
    },
    {
      "id": "A003",
      "name": "taobao",
      "url": "www.taobao.com",
      "likes": 45
    }
]
df1 = pd.DataFrame(data)
display(df1)

     id    name             url  likes
0  A001  runoob  www.runoob.com     61
1  A002  Google  www.google.com    124
2  A003  taobao  www.taobao.com     45

     id    name             url  likes
0  A001  runoob  www.runoob.com     61
1  A002  Google  www.google.com    124
2  A003  taobao  www.taobao.com     45